app/app/controllers/home_controller.rb

SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`day` = '2016-04-12' LIMIT 1
---
  def index
  	time = Time.new
  	time = time.strftime("%Y-%m-%d")

  	quote = Quote.new
  	quote = Quote.find_by day: time