app/app/controllers/quotes_controller.rb

	def index
		@quotes = Quote.all
---
SELECT `quotes`.* FROM `quotes`

	def show
		@quote = Quotes.find(params[:id])
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1

	def edit
		@quote = Quote.find(params[:id])
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1

	def create
		@quote = Quote.new(quote_params)

		if @quote.save
---
INSERT INTO `quotes` (`context`, `author`, `day`, `created_at`, `updated_at`) VALUES ('Just Do It!', 'Shia Lebouf', '2016-04-10', '2016-04-10 08:48:23', '2016-04-10 08:48:23')

	def update
		@quote = Quote.find(params[:id])

		if @quote.update(quote_params)
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1
UPDATE `quotes` SET `context` = 'There is no passion to be found playing small in settling for a life that is less than the one you are capable of living.', `updated_at` = '2016-04-10 09:11:46' WHERE `quotes`.`id` = 2

	def destroy
		@quote = Quote.find(params [:id])
		@quote.destroy
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1
DELETE FROM `quotes` WHERE `quotes`.`id` = 1