app/app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_salt`, `password_hash`, `created_at`, `updated_at`) VALUES ('lance@perrybrothersoil.com', '$2a$10$GWqwY1sv/IFGKAEPtSC5ke', '$2a$10$GWqwY1sv/IFGKAEPtSC5ke9Bddr02syd1cUdm6OF1PmXfj33m6oEC', '2016-07-22 14:56:04', '2016-07-22 14:56:04')
---
	def create
		@user = User.new(user_params)
		if @user.save