app/app/views/home/index.html.erb

  	quote = Quote.new
  	quote = Quote.find_by day: time
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`day` = '2016-04-12' LIMIT 1